#Область ПрограммныйИнтерфейс

Процедура ПриИзмененииСтрокиТабличнойЧасти(Форма) Экспорт
	
	ТекущиёДанные =  Форма.Элементы.Товары.ТекущиеДанные;

	
	Если ТекущиёДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммуВСтрокеТабличнойЧасти(ТекущиёДанные);
	Форма.Объект.СуммаДокумента = Форма.Объект.Товары.Итог("Сумма");
	
	
	Сообщить("записали строку в тч");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)
	
	СуммаПоСтроке = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.Сумма = СуммаПоСтроке; 
	
	Сообщить(СтрШаблон("Сумма по строке: %1", СуммаПоСтроке));	
	
КонецПроцедуры

#КонецОбласти
